GUdaoxi/LR_project1/Drivers/FM33LR0xx_FL_Driver/Inc/fm33lr0xx_fl_atim.h
/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   AFR    BKSYS3E    FL_ATIM_GetBreakInput
  * @param    TIMx TIM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_BKIN_SOURCE_GPIO1
  *           @arg @ref FL_ATIM_BKIN_SOURCE_GPIO2
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP1
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP2
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP3
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP4
  *           @arg @ref FL_ATIM_BKIN_SOURCE_HFDET
  *           @arg @ref FL_ATIM_BKIN_SOURCE_SVD
  *           @arg @ref FL_ATIM_BKIN_SOURCE_LOCKUP
  *           @arg @ref FL_ATIM_BKIN_SOURCE_RAMPARITY
  * @retval   None
  */
__STATIC_INLINE uint32_t FL_ATIM_GetBreakInput(ATIM_Type* TIMx, uint32_t BRKsource)
{
   return (uint32_t)(READ_BIT(TIMx->AFR, ATIM_AFR_BKSYS3E_Msk));
}

/**
  * @}
  */

/** @defgroup ATIM_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_ATIM_DeInit(ATIM_Type *TIMx);
FL_ErrorStatus FL_ATIM_Init(ATIM_Type *TIMx, FL_ATIM_InitTypeDef *TIM_InitStruct);
FL_ErrorStatus FL_ATIM_SlaveMode_Init(ATIM_Type *TIMx, FL_ATIM_SlaveInitTypeDef *TIM_InitStruct);
FL_ErrorStatus  FL_ATIM_IC_Init(ATIM_Type *TIMx, uint32_t channel, FL_ATIM_IC_InitTypeDef *IC_InitStruct);
FL_ErrorStatus  FL_ATIM_ETR_Init(ATIM_Type *TIMx, FL_ATIM_ETR_InitTypeDef *TIM_InitStruct);
FL_ErrorStatus FL_ATIM_OC_Init(ATIM_Type *TIMx, uint32_t channel, FL_ATIM_OC_InitTypeDef *TIM_OC_InitStruct);
FL_ErrorStatus FL_ATIM_BDTR_Init(ATIM_Type *TIMx, uint32_t channel, FL_ATIM_BDTR_InitTypeDef *TIM_BDTR_InitStruct);

/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LR0XX_FL_ATIM_H*/



/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/

